Тестовая_база_ERP_14/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/РасчетыСПоставщикамиПоСрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщикамиПоСрокам</name>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Долг</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПорядокЗачета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.РегистраторРасчетов</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.СписаниеЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСПоставщиками</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПлановогоПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/AccumulationRegisters/РасчетыСПоставщикамиПоСрокам/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроверятьИзмененияРегистра = Неопределено;
	ДополнительныеСвойства.Свойство("ПроверятьИзмененияРегистра", ПроверятьИзмененияРегистра);
	
	Если ПроверятьИзмененияРегистра <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Неопределено;
	ДополнительныеСвойства.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
		
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	
	ПараметрыСравнения = Тестирование.ДополнительныеПараметрыФормированияЗапросаСравнения();
	ПараметрыСравнения.ПроверятьКонтрольнуюСумму = Ложь;
	ТекстыЗапросовДляПолученияТаблицыИзменений = 
		ЗакрытиеМесяцаСервер.ТекстыЗапросовДляПолученияТаблицыИзмененийРегистра(ЭтотОбъект.Метаданные(), ЭтотОбъект.Отбор, ПараметрыСравнения);
	
	СтруктураПроверкиИзмененияРегистра = Новый Структура();
	СтруктураПроверкиИзмененияРегистра.Вставить("ТекстВыборкиТаблицыИзменений", ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиТаблицыИзменений);
	СтруктураПроверкиИзмененияРегистра.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураПроверкиИзмененияРегистра.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиНачальныхДанных;
	Для каждого ЭлементОтбора из ЭтотОбъект.Отбор Цикл
		Если ЭлементОтбора.Использование Тогда
			Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("СтруктураПроверкиИзмененияРегистра", СтруктураПроверкиИзмененияРегистра);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПроверкиИзмененияРегистра = Неопределено;
	Если Не Отказ И ДополнительныеСвойства.Свойство("СтруктураПроверкиИзмененияРегистра", СтруктураПроверкиИзмененияРегистра) Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураПроверкиИзмененияРегистра.МенеджерВременныхТаблиц;
		
		// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
		// и если отличия найдены регистрация документов к отражению в регламентированном, международном учете и учете НДС.	
		Запрос.Текст = СтруктураПроверкиИзмененияРегистра.ТекстВыборкиТаблицыИзменений;
		Для каждого ЭлементОтбора из ЭтотОбъект.Отбор Цикл
			Если ЭлементОтбора.Использование Тогда
				Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		
		НеотражаемыйДокумент = ?(ДополнительныеСвойства.Свойство("НеотражаемыйДокумент"), ДополнительныеСвойства.НеотражаемыйДокумент, Неопределено);
		Запрос.УстановитьПараметр("НеотражаемыйДокумент", НеотражаемыйДокумент);
		
		ТекстАктуализацииОтражения =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор
		|ИЗ
		|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений
		|
		|ГДЕ
		|	ТаблицаИзменений.ДокументРегистратор <> &НеотражаемыйДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.ДокументРегистратор";
				
		//++ НЕ УТ
		ТекстАктуализацииОтражения =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор,
		|	ТаблицаИзменений.Период КАК Период,
		|	ТаблицаИзменений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ИЗ
		|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений
		|
		|ГДЕ
		|	ТаблицаИзменений.ДокументРегистратор <> &НеотражаемыйДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.ДокументРегистратор,
		|	ТаблицаИзменений.Период,
		|	ТаблицаИзменений.АналитикаУчетаПоПартнерам";
		//-- НЕ УТ
			
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстАктуализацииОтражения;
			
		ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
		
		#Область ПроверкаДатыЗапрета
		
		ЗапросПроверкиДатыЗапрета = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МИНИМУМ(ТаблицаИзменений.Период),ДАТАВРЕМЯ(3999,1,1)) КАК Период
		|ИЗ
		|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений");
		
		ЗапросПроверкиДатыЗапрета.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		ВыборкаМинимальногоПериода = ЗапросПроверкиДатыЗапрета.Выполнить().Выбрать();
		Если ВыборкаМинимальногоПериода.Следующий() Тогда
			ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
			
			НоваяСтрока = ДанныеДляПроверки.Добавить();
			НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
			НоваяСтрока.Раздел = "ВзаимозачетыСписанияЗадолженности";
			
			НоваяСтрока = ДанныеДляПроверки.Добавить();
			НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
			НоваяСтрока.Раздел = "ЗакупкиВозвратыПоставщикамПеремещенияСборки";
			
			НоваяСтрока = ДанныеДляПроверки.Добавить();
			НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
			НоваяСтрока.Раздел = "РегламентныеОперации";
			
			ОписаниеОшибки = НСтр("ru = 'Изменяемые данные взаиморасчетов находятся в закрытом периоде.';
									|en = 'Mutual settlements data being changed is in the closed period.'");
			Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, ЭтотОбъект) Тогда
				Отказ = Истина;
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
		КонецЕсли;
		
		#КонецОбласти
		
		//++ НЕ УТ
		#Область ЗаданияКРасчетуРезервыПоСомнительнымДолгам
		
		ИмяТаблицыИзменений = НачислениеСписаниеРезервовПоСомнительнымДолгамСервер.ПодготовитьТаблицуИзмененийПоАналитикеУчетаПоПартнерам(
			Запрос, "ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам");
		НачислениеСписаниеРезервовПоСомнительнымДолгамСервер.СформироватьЗаданияКЗакрытиюМесяцаПриИзмененииРасчетов(Запрос, ИмяТаблицыИзменений);
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(Запрос, ИмяТаблицыИзменений);
		
		#КонецОбласти
		//-- НЕ УТ
		
		//++ НЕ УТ
		РеглУчетПроведениеСервер.ЗарегистрироватьДокументыРасчетовСПартнерамиКОтражениюВРеглУчете(ТаблицаИзменений);
		//-- НЕ УТ
		//++ НЕ УТКА
		МеждународныйУчетПроведениеСервер.ЗарегистрироватьДокументыРасчетовСПартнерамиКОтражениюВМеждународномУчете(ТаблицаИзменений);
		//-- НЕ УТКА
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
		|	Изменения.Регистратор                          КАК Документ,
		|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
		|ИЗ
		|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК Изменения
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
		|	Изменения.РасчетныйДокумент                    КАК Документ,
		|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
		|ИЗ
		|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК Изменения";
		
		УчетНДСУП.ОтразитьВУчетеНДСИзменениеРасчетовСПоставщиками(Запрос.Выполнить().Выгрузить());
		
		// Уничтожаем временную таблицу изменений, т.к. могут записываться разные наборы записей с одним менеджером запросов.
		УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(Запрос, "ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
